In [1]:
import pandas as pd ; import numpy as np

In [2]:
ornek= pd.Series([1,2,3,4], index=["a","b","c","d"])
ornek

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
ornek["a"]

1

In [4]:
ornek2=ornek.reindex(["b","d","a","c","e"])
ornek2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

ornek3=pd.Series(["kırmızı","mavi","mor"],index=[0,2,4])
ornek3

In [9]:
ornek3=pd.Series(["kırmızı","mor"],index=[0,2])
ornek3

0    kırmızı
2        mor
dtype: object

In [12]:
ornek3.reindex(range(7),method="ffill")

0    kırmızı
1    kırmızı
2        mor
3        mor
4        mor
5        mor
6        mor
dtype: object

In [13]:
df=pd.DataFrame(np.arange(9).reshape(3,3),index=["a","b","c"],columns=["caner","ali","veli"])

In [14]:
df

   caner  ali  veli
a      0    1     2
b      3    4     5
c      6    7     8

In [15]:
df2=df.reindex(["d","c","b","a"])
df2

   caner  ali  veli
d    NaN  NaN   NaN
c    6.0  7.0   8.0
b    3.0  4.0   5.0
a    0.0  1.0   2.0

In [18]:
ad=["ayşe","fatma","ali"]
df.reindex(columns=ad)

   ayşe  fatma  ali
a   NaN    NaN    1
b   NaN    NaN    4
c   NaN    NaN    7

In [20]:
df.loc[["c","b","a"]]

   caner  ali  veli
c      6    7     8
b      3    4     5
a      0    1     2

In [21]:
x=pd.Series(np.arange(5),index=["a","b","c","d","e"])
x

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [22]:
x1=x.drop("c")
x1

a    0
b    1
d    3
e    4
dtype: int32

In [23]:
x.drop(["c","e"])

a    0
b    1
d    3
dtype: int32

In [26]:
dtf=pd.DataFrame(np.arange(16).reshape(4,4),index=["caner","ali","ayşe","elif"],
                columns=list("ABCD"))
dtf

        A   B   C   D
caner   0   1   2   3
ali     4   5   6   7
ayşe    8   9  10  11
elif   12  13  14  15

In [27]:
dtf.drop(["caner","ali"])

       A   B   C   D
ayşe   8   9  10  11
elif  12  13  14  15

In [28]:
dtf.drop("B",axis=1)

        A   C   D
caner   0   2   3
ali     4   6   7
ayşe    8  10  11
elif   12  14  15

In [29]:
dtf.drop("ali",axis=0)

        A   B   C   D
caner   0   1   2   3
ayşe    8   9  10  11
elif   12  13  14  15